In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

### Sort in Series

In [2]:
s1 = Series(np.random.randn(10))

In [3]:
s1

0    0.366722
1    0.940984
2   -0.559927
3   -0.727552
4    0.076129
5    2.206292
6    0.104361
7   -0.625427
8   -2.403743
9    1.552243
dtype: float64

In [5]:
s1.values

array([ 0.36672186,  0.94098432, -0.55992651, -0.72755229,  0.07612887,
        2.20629161,  0.10436087, -0.62542715, -2.40374258,  1.55224253])

In [6]:
s1.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
s2 = s1.sort_values() #ascending = True or False

In [8]:
s2

8   -2.403743
3   -0.727552
7   -0.625427
2   -0.559927
4    0.076129
6    0.104361
0    0.366722
1    0.940984
9    1.552243
5    2.206292
dtype: float64

In [9]:
s2.sort_index()

0    0.366722
1    0.940984
2   -0.559927
3   -0.727552
4    0.076129
5    2.206292
6    0.104361
7   -0.625427
8   -2.403743
9    1.552243
dtype: float64

### Sort in DataFrame

In [12]:
df1 = DataFrame(np.random.randn(40).reshape(8,5),columns=['A','B','C','D','E'])

In [13]:
df1

          A         B         C         D         E
0  0.272667  1.052579  0.699528 -0.641602  0.867975
1  0.785169  0.434857 -0.922811 -0.839049 -1.309610
2 -0.205150  1.902139 -2.008908 -0.740521  0.862872
3 -0.737323  1.609039 -3.495658 -0.054505  0.877790
4  0.116083 -0.267447 -0.587651  0.253287 -0.273067
5  0.140788 -2.063020  0.633721 -0.563801 -0.094216
6  0.366862 -0.273814 -1.040087  0.852178 -2.345884
7 -0.414671  0.569516  0.976786  0.264439 -0.386644

In [15]:
# Sort by column A
df1['A'].sort_values()

3   -0.737323
7   -0.414671
2   -0.205150
4    0.116083
5    0.140788
0    0.272667
6    0.366862
1    0.785169
Name: A, dtype: float64

In [17]:
df2 = df1.sort_values('A') # can use ascending to define if ascending or descending
df2

          A         B         C         D         E
3 -0.737323  1.609039 -3.495658 -0.054505  0.877790
7 -0.414671  0.569516  0.976786  0.264439 -0.386644
2 -0.205150  1.902139 -2.008908 -0.740521  0.862872
4  0.116083 -0.267447 -0.587651  0.253287 -0.273067
5  0.140788 -2.063020  0.633721 -0.563801 -0.094216
0  0.272667  1.052579  0.699528 -0.641602  0.867975
6  0.366862 -0.273814 -1.040087  0.852178 -2.345884
1  0.785169  0.434857 -0.922811 -0.839049 -1.309610

In [18]:
# Sort by index
df2.sort_index()

          A         B         C         D         E
0  0.272667  1.052579  0.699528 -0.641602  0.867975
1  0.785169  0.434857 -0.922811 -0.839049 -1.309610
2 -0.205150  1.902139 -2.008908 -0.740521  0.862872
3 -0.737323  1.609039 -3.495658 -0.054505  0.877790
4  0.116083 -0.267447 -0.587651  0.253287 -0.273067
5  0.140788 -2.063020  0.633721 -0.563801 -0.094216
6  0.366862 -0.273814 -1.040087  0.852178 -2.345884
7 -0.414671  0.569516  0.976786  0.264439 -0.386644

In [21]:
movie = pd.read_csv('movie_metadata.csv')

In [22]:
movie

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [24]:
hw1 = movie[['imdb_score','director_name','movie_title']]

In [25]:
hw1

,imdb_score,director_name,movie_title
0,7.9,James Cameron,Avatar
1,7.1,Gore Verbinski,Pirates of the Caribbean: At World's End
2,6.8,Sam Mendes,Spectre
3,8.5,Christopher Nolan,The Dark Knight Rises
4,7.1,Doug Walker,Star Wars: Episode VII - The Force Awakens ...
...,...,...,...
5038,7.7,Scott Smith,Signed Sealed Delivered
5039,7.5,NaN,The Following
5040,6.3,Benjamin Roberds,A Plague So Pleasant
5041,6.3,Daniel Hsia,Shanghai Calling
5042,6.6,Jon Gunn,My Date with Drew

In [27]:
hw1 = hw1.sort_values('imdb_score',ascending=False)
hw1

      imdb_score         director_name                      movie_title
2765         9.5        John Blanchard    Towering Inferno
1937         9.3        Frank Darabont        The Shawshank Redemption
3466         9.2  Francis Ford Coppola                   The Godfather
3207         9.1                   NaN             Dekalog
4409         9.1        John Stockwell            Kickboxer: Vengeance
...          ...                   ...                              ...
2295         1.9             Bob Clark    Superbabies: Baby Geniuses 2
2268         1.9       Jason Friedberg                  Disaster Movie
4605         1.9         A. Raven Cruz             The Helix... Loaded
1136         1.7     Lawrence Kasanoff                      Foodfight!
2834         1.6            Jon M. Chu  Justin Bieber: Never Say Never

[5043 rows x 3 columns]

In [31]:
hw1.to_csv('hw1.csv')

In [33]:
#combine all the code in just one line
movie[['imdb_score','director_name','movie_title']].sort_values('imdb_score',ascending = False).to_csv('hw1_2.csv')

In [30]:
ls

 Volume in drive C is OS
 Volume Serial Number is 5ECB-C6A3

 Directory of C:\Users\stell\Desktop\Python Stella\Python3 Basic and Data Analysis

02/11/2020  09:16 PM    <DIR>          .
02/11/2020  09:16 PM    <DIR>          ..
02/11/2020  09:16 PM    <DIR>          .ipynb_checkpoints
02/10/2020  11:23 PM            12,898 Calculation in Series and DataFrame.ipynb
02/03/2020  09:57 PM            22,925 Dataframe IO.ipynb
02/03/2020  09:51 PM               509 df.csv
02/03/2020  09:53 PM             2,057 df.html
02/03/2020  09:56 PM             5,257 df.xlsx
02/11/2020  09:16 PM           212,877 hw1.csv
02/10/2020  10:57 PM            12,463 Mapping and Replace.ipynb
09/27/2019  06:09 PM         1,494,688 movie_metadata.csv
02/10/2020  10:40 PM            11,443 Multi-Index.ipynb
02/10/2020  10:07 PM            28,013 NaN.ipynb
11/13/2017  05:09 AM    <DIR>          o25mso
02/11/2020  09:15 PM            37,316 Pandas - Continue.ipynb
01/30/2020  11:17 PM            44,375 Pandas - Dataframe.ipynb
01/28/2020  09:18 PM             8,398 Pandas.ipynb
02/03/2020  10:32 PM            20,724 Re-indexing Series and DataFrame.ipynb
02/03/2020  10:18 PM            49,112 SELECTing and INDEXing.ipynb
              15 File(s)      1,963,055 bytes
               4 Dir(s)  187,801,710,592 bytes free

## Rename the index of DataFrame

In [34]:
df1 = DataFrame(np.arange(9).reshape(3,3), index=['BJ','SH','GZ'],columns=['A','B','C'])

In [35]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [36]:
df1.index = Series(['bj','sh','gz'])

In [37]:
df1

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [39]:
df1.index = df1.index.map(str.upper)

In [40]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [41]:
df1.rename(index=str.lower)

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [42]:
df1.rename(columns=str.lower)

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [45]:
df1.rename(index={'BJ':'Beijing'}, columns={'A':'a'}) #Use dictionary to change a specific index

         a  B  C
Beijing  0  1  2
SH       3  4  5
GZ       6  7  8

In [46]:
# use list1 to get list2
list1 = [1,2,3,4]
list2 = ['1','2','3','4']

In [47]:
#1
list2 = []
for i in list1:
    i = str(i)
    list2.append(i)

In [48]:
list2

['1', '2', '3', '4']

In [49]:
#2
[str(x) for x in list1]

['1', '2', '3', '4']

In [52]:
#3
list(map(str, list1))

['1', '2', '3', '4']

In [53]:
def test_map(x):
    return x + '_ABC'

In [54]:
df1.index.map(test_map)

Index(['BJ_ABC', 'SH_ABC', 'GZ_ABC'], dtype='object')

In [55]:
df1.rename(index = test_map)

        A  B  C
BJ_ABC  0  1  2
SH_ABC  3  4  5
GZ_ABC  6  7  8

## Merge in DataFrame

In [57]:
df11 = DataFrame({'Key':['X','Y','Z'],'data_set_1':[1,2,3]})

In [58]:
df11

  Key  data_set_1
0   X           1
1   Y           2
2   Z           3

In [64]:
df12 = DataFrame({'Key':['A','B','C'],'data_set_2':[4,5,6]})

In [65]:
df12

  Key  data_set_2
0   A           4
1   B           5
2   C           6

In [66]:
pd.merge(df11, df12) # need to have common column name to merge two dataframe

Empty DataFrame
Columns: [Key, data_set_1, data_set_2]
Index: []

In [70]:
df13 = DataFrame({'Key':['X','Y','Z','X'],'data_set_1':[1,2,3,4]}) 
df13

  Key  data_set_1
0   X           1
1   Y           2
2   Z           3
3   X           4

In [71]:
df14 = DataFrame({'Key':['X','B','C'],'data_set_2':[4,5,6]})
df14

  Key  data_set_2
0   X           4
1   B           5
2   C           6

In [69]:
pd.merge(df13,df14)

  Key  data_set_1  data_set_2
0   X           1           4
1   X           4           4

In [73]:
pd.merge(df13, df14, on='Key') #on need  to be a common column

  Key  data_set_1  data_set_2
0   X           1           4
1   X           4           4

In [74]:
# how = inner, left, right, outer (join type)
pd.merge(df13, df14, how='left')

  Key  data_set_1  data_set_2
0   X           1         4.0
1   Y           2         NaN
2   Z           3         NaN
3   X           4         4.0

In [75]:
pd.merge(df13, df14, how='right')

  Key  data_set_1  data_set_2
0   X         1.0           4
1   X         4.0           4
2   B         NaN           5
3   C         NaN           6

In [76]:
pd.merge(df13, df14, how='outer')

  Key  data_set_1  data_set_2
0   X         1.0         4.0
1   X         4.0         4.0
2   Y         2.0         NaN
3   Z         3.0         NaN
4   B         NaN         5.0
5   C         NaN         6.0